Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыеРезультатыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Сделка/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	//Элементы.НДС.Видимость = Объект.УчитыватьНДС Или ПолучитьФункциональнуюОпцию("_ДемоУчитыватьНДС");
	//Элементы.СтавкаНДС.Доступность = Объект.УчитыватьНДС;

	//// СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ПриЧтенииСозданииНаСервере();

	Элементы.ВидСделки.СписокВыбора.Добавить(Перечисления.ВидыСделок.Покупка);
	Элементы.ВидСделки.СписокВыбора.Добавить(Перечисления.ВидыСделок.Продажа);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПриЧтенииСозданииНаСервере();

	//// СтандартныеПодсистемы.ДатыЗапретаИзменения
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//ОпределитьНоменклатуруТребующуюВводГТД();

	//// СтандартныеПодсистемы.КонтрольВеденияУчета
	//КонтрольВеденияУчета.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	Для Каждого СтрокаТ Из Объект.Позиции Цикл

		СтрокаТ.СуммаСделки = СтрокаТ.Количество * СтрокаТ.Цена; // * ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТ.Инструмент, "РазмерЛота");
		//РассчитатьСуммуСделкиВСтроке(СтрокаТ);
		Если Объект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			РассчитатьПрибыльВСтроке(СтрокаТ);
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(Объект.ВалютаСделки) И НЕ ЗначениеЗаполнено(Объект.КурсСделки) Тогда

		УстановкаКурсаВалюты();

	КонецЕсли;

	Если Объект.Позиции.Количество() > 0 Тогда

		ВывестиОстатки();

	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьСчетчикиСтрокТаблиц();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//	ВывестиОстатки();
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ПроверитьВалютуВСтроках(Отказ);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаСделкиПриИзменении(Элемент)
	УстановкаКурсаВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановкаКурсаВалюты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПозицииКоличествоПриИзменении(Элемент)

	ВыполнитьВычисленияПриИзмененииСтроки();
	//СтруктураДействий = Новый Структура;
	//	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);

	//ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	//
	//РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	//
	//СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииЦенаПриИзменении(Элемент)

	ВыполнитьВычисленияПриИзмененииСтроки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте //НаСервереБезКонтекста
Процедура РассчитатьСуммуСделкиВСтроке(СтрокаТ)

	//РазмерЛота = ЗначениеРеквизитаОбъекта(СтрокаТ.Инструмент, "Лот");
	СтрокаТ.Количество = СтрокаТ.КоличествоЛотов * СтрокаТ.РазмерЛота;
	СтрокаТ.СуммаСделки = СтрокаТ.Количество * СтрокаТ.Цена;

КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, Реквизит)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);

КонецФункции // ЗначениеРеквизитаОбъекта()

&НаСервере
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);

КонецФункции // ЗначенияРеквизитовОбъекта()

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидСделки");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Перечисления.ВидыСделок.Покупка;
	ЭлементОтбораДанных.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ЭлементОформляемогоПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементОформляемогоПоля.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПозицииПрибыль.Имя);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Позиции.Прибыль");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбораДанных.ПравоеЗначение = 0;
	ЭлементОтбораДанных.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтрицательногоЗначения);
	ЭлементОформляемогоПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементОформляемогоПоля.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПозицииПрибыль.Имя);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Позиции.Прибыль");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбораДанных.ПравоеЗначение = 0;
	ЭлементОтбораДанных.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоложительногоЗначения);
	ЭлементОформляемогоПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементОформляемогоПоля.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПозицииПрибыль.Имя);

КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокиНаСервере()

	ОбщегоНазначения.СкопироватьСтрокиВБуферОбмена(Объект.Позиции, Элементы.Позиции.ВыделенныеСтроки, "Позиции");

КонецПроцедуры

&НаСервере
Функция ВставитьСтрокиНаСервере()

	ДанныеИзБуфераОбмена = ОбщегоНазначения.СтрокиИзБуфераОбмена();
	Если ДанныеИзБуфераОбмена.Источник <> "Позиции" Тогда
		Возврат 0;
	КонецЕсли;

	Таблица = ДанныеИзБуфераОбмена.Данные;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗаполнитьЗначенияСвойств(Объект.Позиции.Добавить(), СтрокаТаблицы);
	КонецЦикла;

	//ОпределитьНоменклатуруТребующуюВводГТД();

	Возврат Таблица.Количество();

КонецФункции

&НаКлиенте
Процедура ОбновитьСчетчикиСтрокТаблиц()
	//УстановитьЗаголовокСтраницы(Элементы, Объект.Позиции, НСтр("ru = 'Позиции'"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницы(ЭлементСтраница, РеквизитТабличнаяЧасть, ЗаголовокПоУмолчанию)
	ЗаголовокСтраницы = ЗаголовокПоУмолчанию;
	Если РеквизитТабличнаяЧасть.Количество() > 0 Тогда
		ЗаголовокСтраницы = ЗаголовокПоУмолчанию + " (" + РеквизитТабличнаяЧасть.Количество() + ")";
	КонецЕсли;
	ЭлементСтраница.Заголовок = ЗаголовокСтраницы;
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПриИзменении(Элемент)

	//Если Элементы.Позиции.ТекущаяСтрока <> Неопределено Тогда
	//	Если Не ЗначениеЗаполнено(Объект.ВалютаСделки) Тогда
	//		ЗаполнитьВалютуПоИнструменту(Элементы.Позиции.ТекущиеДанные.Инструмент);
	//	КонецЕсли;
	//КонецЕсли;
	ОбновитьСчетчикиСтрокТаблиц();

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрибыльВСтроке(Знач СтрокаТ = Неопределено, ИдентификаторТекущейСтроки = Неопределено)

	Если СтрокаТ = Неопределено Тогда
		СтрокаТ = Объект.Позиции.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК КурсВалюты
		|ПОМЕСТИТЬ втКурсВалюты
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПозицииИнструментовОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ ПозицииИнструментовОстатки.СтоимостьОстаток / ПозицииИнструментовОстатки.КоличествоОстаток / втКурсВалюты.КурсВалюты
		|	КОНЕЦ КАК СредняяЦена
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки(
		|			&Дата,
		|			Портфель = &Портфель
		|				И Инструмент = &Инструмент) КАК ПозицииИнструментовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсВалюты КАК втКурсВалюты
		|		ПО (ИСТИНА)";

	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Инструмент", СтрокаТ.Инструмент);
	Запрос.УстановитьПараметр("Портфель", Объект.Портфель);
	Запрос.УстановитьПараметр("Валюта", Объект.ВалютаСделки);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		СредняяЦена = Выборка.СредняяЦена;
	Иначе
		Возврат;
	КонецЕсли;

	СтрокаТ.Прибыль = СтрокаТ.Количество * (СтрокаТ.Цена - СредняяЦена) - СтрокаТ.Комиссия;


КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВычисленияПриИзмененииСтроки()

	ТекущаяСтрока = Элементы.Позиции.ТекущиеДанные;

	РассчитатьСуммуСделкиВСтроке(ТекущаяСтрока);
	Элементы.ПозицииКомиссия.ПодсказкаВвода = Окр(ТекущаяСтрока.СуммаСделки * 0.0004, 2);
	ИдентификаторТекущейСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	РассчитатьПрибыльВСтроке( , ИдентификаторТекущейСтроки);
	ВывестиОстатки();

КонецПроцедуры // ВыполнитьВычисленияПриИзмененииСтроки()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВывестиОстатки()

	ЗаполнитьОстатки(Объект.Позиции, Объект.Портфель);

КонецПроцедуры // ВывестиОстатки()

&НаСервере
Процедура ЗаполнитьОстатки(ТЧ, Портфель)

	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Значения.Инструмент КАК Инструмент
			|ПОМЕСТИТЬ Значения
			|ИЗ
			|	&ТЧ КАК Значения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Значения.Инструмент КАК Инструмент,
			|	СпрИнструменты.РазмерЛота КАК РазмерЛота,
			|	ЕСТЬNULL(ПозицииИнструментов.КоличествоОстаток, 0) / СпрИнструменты.РазмерЛота КАК Остаток
			|ИЗ
			|	Значения КАК Значения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПозицииИнструментов.Остатки(
			|				,
			|				(Портфель, Инструмент) В
			|					(ВЫБРАТЬ
			|						&Портфель,
			|						Значения.Инструмент
			|					ИЗ
			|						Значения КАК Значения)) КАК ПозицииИнструментов
			|		ПО (ПозицииИнструментов.Инструмент = Значения.Инструмент)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК СпрИнструменты
			|		ПО Значения.Инструмент = СпрИнструменты.Ссылка");

	//Запрос.УстановитьПараметр("Инструменты", ТЧ.Выгрузить(, "Инструмент").ВыгрузитьКолонку("Инструмент"));
	Запрос.УстановитьПараметр("ТЧ", ТЧ.Выгрузить( , "Инструмент"));
	Запрос.УстановитьПараметр("Портфель", Портфель);

	Остатки = Запрос.Выполнить().Выгрузить();
	Остатки.Индексы.Добавить("Инструмент");

	Для Каждого СтрокаТЧ Из ТЧ Цикл
		Отбор = Новый Структура("Инструмент", СтрокаТЧ.Инструмент);
		СтрокаОстатки = Остатки.НайтиСтроки(Отбор);
		Если СтрокаОстатки.Количество() Тогда
			СтрокаОстатков = СтрокаОстатки[0];
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаОстатков, "Остаток, РазмерЛота");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьОстатки()

&НаСервере
Процедура ПозицииКоличествоПриИзмененииНаСервере(ИдентификаторТекущейСтроки)

	СтрокаТ = Объект.Позиции.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	//РазмерЛота = ЗначениеРеквизитаОбъекта(СтрокаТ.Инструмент, "Лот");
	СтрокаТ.КоличествоЛотов = СтрокаТ.Количество / СтрокаТ.РазмерЛота;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииКоличествоПриИзменении1(Элемент)

	ИдентификаторТекущейСтроки = Элементы.Позиции.ТекущиеДанные.ПолучитьИдентификатор();
	ПозицииКоличествоПриИзмененииНаСервере(ИдентификаторТекущейСтроки);

КонецПроцедуры

&НаСервере
Процедура ПозицииИнструментПриИзмененииНаСервере(ИдентификаторТекущейСтроки)

	СтрокаТ = Объект.Позиции.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РеквизитыИнструмента = ЗначенияРеквизитовОбъекта(СтрокаТ.Инструмент, "РазмерЛота, ВалютаНоминала");
	СтрокаТ.РазмерЛота = РеквизитыИнструмента.РазмерЛота;
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаСделки) Тогда
		//ЗаполнитьВалютуПоИнструменту(Элементы.Позиции.ТекущиеДанные.Инструмент);
		Объект.ВалютаСделки = РеквизитыИнструмента.ВалютаНоминала;
		УстановкаКурсаВалюты();
	ИначеЕсли Объект.ВалютаСделки <> РеквизитыИнструмента.ВалютаНоминала Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отличается валюта сделки (%1) и валюта номинала (%2) инструмента %3",
				Объект.ВалютаСделки, РеквизитыИнструмента.ВалютаНоминала, СтрокаТ.Инструмент), , "ВалютаСделки");
	КонецЕсли;

	//ЗначенияРеквизитовОбъекта = ЗначенияРеквизитовОбъекта(СтрокаТ.Инструмент, "РазмерЛота, ВалютаНоминала");
	//СтрокаТ.РазмерЛота = ЗначенияРеквизитовОбъекта.РазмерЛота;
	//	СтрокаТ.ВалютаСделки = ЗначенияРеквизитовОбъекта.ВалютаНоминала;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииИнструментПриИзменении(Элемент)

	ИдентификаторТекущейСтроки = Элементы.Позиции.ТекущиеДанные.ПолучитьИдентификатор();
	ПозицииИнструментПриИзмененииНаСервере(ИдентификаторТекущейСтроки);

КонецПроцедуры

&НаСервере
Процедура УстановкаКурсаВалюты()

	Объект.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(Объект.Дата, Объект.ВалютаСделки);

КонецПроцедуры

&НаСервере
Процедура ПроверитьВалютуВСтроках(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Инструменты.Ссылка КАК Инструмент,
		|	Инструменты.ВалютаНоминала КАК ВалютаНоминала
		|ИЗ
		|	Справочник.Инструменты КАК Инструменты
		|ГДЕ
		|	Инструменты.Ссылка В(&Инструменты)
		|	И Инструменты.ВалютаНоминала <> &ВалютаСделки";

	Запрос.УстановитьПараметр("Инструменты", Объект.Позиции.Выгрузить( , "Инструмент").ВыгрузитьКолонку("Инструмент"));
	Запрос.УстановитьПараметр("ВалютаСделки", Объект.ВалютаСделки);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отличается валюта сделки (%1) и валюта номинала (%2) инструмента %3",
				Объект.ВалютаСделки, Выборка.ВалютаНоминала, Выборка.Инструмент), , "ВалютаСделки", , Отказ);
	КонецЦикла;

КонецПроцедуры

//// <Описание процедуры>
////
//// Параметры:
////  <Параметр1>  - <Тип.Вид> - <описание параметра>
////                 <продолжение описания параметра>
////  <Параметр2>  - <Тип.Вид> - <описание параметра>
////                 <продолжение описания параметра>
////
//&НаСервере
//Процедура ЗаполнитьВалютуПоИнструменту(Инструмент)

//	Объект.ВалютаСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "ВалютаНоминала");

//КонецПроцедуры // ЗаполнитьВалютуПоИнструменту()

#КонецОбласти
